{
    "displayName": "CA-01- All Apps - All Admins - Require MFA.json",
    "createdDateTime": null,
    "modifiedDateTime": null,
    "state": "disabled",
    "sessionControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [],
        "platforms": null,
        "locations": null,
        "deviceStates": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": ["William@vastgoed01.onmicrosoft.com"],
            "excludeUsers": ["wim@vastgoed01.onmicrosoft.com"],
            "includeGroups": [
                "CA-01 - Inclusion",
                "CA-01 - Inclusion2"
            ],
            "excludeGroups": ["CA-01 - Exclusion"],
            "includeRoles": [
                "Company Administrator",
                "Exchange Service Administrator",
                "SharePoint Service Administrator",
                "Application Developer"                
            ],
            "excludeRoles": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}
