{
    "displayName": "CA-01- All Apps - All Admins - Require MFA",
    "createdDateTime": null,
    "modifiedDateTime": null,
    "state": "disabled",
    "sessionControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [],
        "platforms": null,
        "locations": null,
        "deviceStates": null,
        "applications": {
            "includeApplications": [
                "Office 365",
                "Microsoft Azure Management"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": ["William@poriamdev.onmicrosoft.com"],
            "excludeUsers": ["wim@poriamdev.onmicrosoft.com"],
            "includeGroups": [
                "CA-01 - Inclusion5099",
                "CA-01 - Inclusion6099"
            ],
            "excludeGroups": ["CA-01 - Exclusion"],
            "includeRoles": ["All"],
            "excludeRoles": []
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "mfa"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    }
}
